:PROPERTIES:
:GPTEL_MODEL: gpt-4o
:GPTEL_BACKEND: ChatGPT
:GPTEL_SYSTEM: You are a large language model living in Emacs and a helpful assistant. Avoid long answers.
:GPTEL_BOUNDS: nil
:END:

*** write a script
#+begin_src python :results output
import random

nbrs = list(range(501))
[print(i, end=' ') for i in nbrs]
print('\n')
random.shuffle(nbrs)
[print(i, end=' ') for i in nbrs]
#+end_src

#+RESULTS:
: 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 
: 
: 388 424 202 69 126 288 351 492 41 410 350 457 216 201 92 47 217 478 196 398 185 149 362 254 336 115 27 334 51 423 226 212 113 52 26 381 91 384 442 133 255 157 59 97 100 406 24 458 81 451 276 117 280 475 482 222 295 194 89 432 207 358 76 408 42 400 82 0 268 335 411 486 373 200 327 387 136 441 368 279 55 146 304 317 331 123 281 43 289 189 10 436 324 80 356 316 31 96 110 287 208 240 344 163 298 329 445 245 15 385 218 172 302 19 30 33 266 453 326 265 382 77 250 374 68 148 401 132 221 474 57 262 244 195 105 64 13 416 75 162 165 219 273 147 455 444 182 18 178 210 143 456 430 155 439 204 99 345 402 434 278 142 238 392 251 158 450 357 386 253 259 413 25 272 5 366 452 252 107 180 168 231 114 140 78 483 306 314 22 310 472 170 323 223 367 435 8 118 284 419 337 275 471 151 415 159 9 393 369 102 124 396 467 431 348 45 56 270 395 54 188 390 277 145 264 263 480 397 405 121 440 399 74 426 346 283 487 174 141 322 236 109 271 493 108 380 44 339 247 446 427 477 377 285 364 462 53 311 490 297 49 85 309 171 154 35 72 95 412 499 58 500 232 321 193 234 206 137 32 213 241 261 144 29 192 36 294 209 433 90 375 176 87 429 93 211 129 190 476 187 152 428 438 491 101 248 17 139 404 307 214 215 352 177 12 7 203 496 341 299 320 461 6 463 186 249 246 98 365 342 418 235 161 460 153 83 125 66 420 63 191 330 138 343 286 224 354 447 48 242 205 167 291 228 62 437 37 111 67 128 448 376 494 319 308 106 296 14 94 239 315 46 407 353 325 269 164 220 464 282 169 50 86 267 489 469 28 71 104 198 485 257 328 292 122 160 243 119 227 290 39 372 16 229 120 3 359 332 313 422 130 340 470 394 237 256 88 338 112 135 389 150 497 23 1 38 73 116 360 197 484 403 370 303 70 4 473 258 127 481 488 371 305 454 498 34 301 134 466 199 233 421 318 495 65 184 300 274 84 181 131 60 61 103 417 312 459 409 225 355 40 183 465 79 333 378 414 349 293 2 175 173 363 156 361 230 468 20 443 21 347 479 379 425 11 383 260 166 449 391 179
